// Створити масив, довжину та елементи якого задає користувач.
// Відсортувати масив за зростанням.
// Видалити елементи з масиву з 2 по 4 (включно!).
// У міру змін виводити вміст масиву на сторінку.

const arrLength = parseInt(prompt("Введіть довжину масиву:"));

const arr = [...Array(arrLength)].map(() => prompt("Введіть елемент масиву:"));
document.write(`Початковий масив: (${arr}) <br>`);

arr.sort((a, b) => a - b);
document.write(`Відсортований масив: (${arr}) <br>`);

arr.splice(1, 3);
document.write(`Масив після видалення елементів з 2 по 4 включно: (${arr}) <br>`);
